---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalResourceBrowserData
source: html/c39d1def-f2be-5ebc-a44d-6c4f33d2cdeb.htm
---
# ExternalResourceBrowserData Methods

Adds an external resource to the folder path by supplying the resource name.